#pragma once
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
struct SAIConsts
{
	// макс. размер карты, макс. длина пути, макс. длина маленького пути, макс. 
	// кол-во ячеек, занятых юнитом, макс. кол-во юнитов, размер AI тайла,
	// максимальное количество дипломатических сторон
	enum 
	{ 
		MAX_MAP_SIZE = 1024, 
		INFINITY_PATH_LIMIT = 5000, 
		MAX_LENGTH_OF_SMALL_PATH = 20, 
		MAX_NUMBER_OF_UNITS = 3000,
		// чтобы сменить продолжительность AI сегмента, необходимо подправиться (кроме этого) еще два места:
		// 1. GameX\Initialization.cpp, NGlobal::SetVar( "AI_SEGMENT_DURATION", 200 );
		// 2. Script\lapi.cpp, thisThreadIsSleeping = lfToSleep * 50 / 200;
		AI_SEGMENT_DURATION = 200,
		TILE_SIZE = 32,
		MAX_NUM_OF_PLAYERS = 16,
		VIS_POWER = 7,
		WAR_FOG_FULL_UPDATE = 200,
	};
};
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

